import numpy as np
import matplotlib.pyplot as plt
import statsmodels.api as sm

function = int(input('Введите номер решения задачи[1,2]: '))

yi = [401, 452, 478, 397, 453, 427, 396, 399, 418, 413, 412, 423, 393, 381, 401]
xi1 = [17, 22, 18, 24, 19, 20, 17, 21, 18, 22, 20, 17, 15, 21, 15]
xi2 = [130, 180, 217, 103, 171, 180, 140, 92, 173, 87, 93, 210, 110, 86, 175]
xi3 = [523, 518, 510, 516, 511, 471, 523, 498, 542, 501, 471, 523, 538, 472, 467]
xi4 = [2517, 2801, 2573, 2643, 2801, 2815, 2527, 2735, 2817, 2736, 2682, 2593, 2627, 2532, 2693]

yi_ = [6, 8, 14, 20, 26]
xi1_ = [1, 2, 1, 3, 5]
xi2_ = [1, 2, 0, 2, 2]
xi3_ = [2, 1, 0, 1, 2]

if function == 1:

    X = np.column_stack((np.ones(len(xi1)), xi1, xi2, xi3, xi4))
    model = sm.OLS(yi, X).fit()
    print(model.summary())